app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @friend = Friend.new(friend_params)

    respond_to do |format|
      if @friend.save